In [1]:
import pandas as pd
import openpyxl
from pathlib import Path
input_file = Path.cwd()/'data'/'raw'/'sample_sales.xlsx'
df = pd.read_excel(input_file,engine='openpyxl')
df.head()

     invoice   company purchase_date product  quantity  price  extended amount
0  ZN-870-29  Realcube    2019-03-05   shirt        19     17              323
1  JQ-501-63     Zooxo    2019-07-09    book        30     14              420
2  FI-165-58   Dabtype    2019-08-12  poster         7     23              161
3  XP-005-55  Skipfire    2019-11-18     pen         7     29              203
4  NB-917-18  Bluezoom    2019-04-18  poster        36     19              684

## Aggregation

Simple aggregation

In [2]:
df['price'].agg(['mean'])

mean    22.816
Name: price, dtype: float64

Adding aggregations

In [3]:
df['price'].agg(['mean','std'])

mean    22.816000
std      7.537039
Name: price, dtype: float64

Defining the columns and aggregations in a dictionary

In [4]:
agg_cols = {'quantity':'sum',
            'price':['mean','std'],
           'invoice':'count',
           'extended amount':'sum'}

In [5]:
df.agg(agg_cols)

       quantity      price  invoice  extended amount
sum     22421.0        NaN      NaN         510270.0
mean        NaN  22.816000      NaN              NaN
std         NaN   7.537039      NaN              NaN
count       NaN        NaN   1000.0              NaN

Aggregation across all columns (which sometimes doesn't make sense, e.g. mean of product names)

In [6]:
df.agg(['mean','max'])

,invoice,company,purchase_date,product,quantity,price,extended amount
max,ZY-479-41,Zoozzy,2019-12-30 00:00:00.000,shirt,50.000,35.000,1715.00
mean,NaN,NaN,2019-07-04 17:41:16.800,NaN,22.421,22.816,510.27

Zap those NaN's

In [7]:
df.agg(['mean','max']).fillna("")

,invoice,company,purchase_date,product,quantity,price,extended amount
max,ZY-479-41,Zoozzy,2019-12-30 00:00:00.000,shirt,50.000,35.000,1715.00
mean,,,2019-07-04 17:41:16.800,,22.421,22.816,510.27

## Grouping

Group by product, and sum all values (note that it intelligently ignores the sum of entities that don't make sense to sum, e.g. company name)

In [8]:
df.groupby(['product']).sum()

         quantity  price  extended amount
product
book         5340   5115           118356
pen          5005   5271           115017
poster       5827   6258           139008
shirt        6249   6172           137889

Group by product, but only sum over quantity

In [9]:
df.groupby(['product'])['quantity'].sum()

product
book      5340
pen       5005
poster    5827
shirt     6249
Name: quantity, dtype: int64

Another way to achieve the same end, this time by using a dictionary like last time, a dictionary that contains the columns that we would like to aggregate. This below is saying we want to aggregate the column 'quantity', and we want to get the 'sum' of this aggregation.

In [10]:
agg_cols = {'quantity' : 'sum'}

In [11]:
df.groupby(['product']).agg(agg_cols)

         quantity
product
book         5340
pen          5005
poster       5827
shirt        6249

Having obtained the universal sum of products sold, this is how you do the sum but by company.

In [12]:
df.groupby(['company','product']).agg(agg_cols)

                 quantity
company product
Abatz   book           64
        pen             7
        poster         39
Agivu   book           11
        shirt          20
...                   ...
Zooxo   book           30
        shirt          85
Zoozzy  pen            31
        poster         31
        shirt          23

[731 rows x 1 columns]

Reset the index (not sure why you'd want to do this)

In [13]:
df.groupby(['company','product']).agg(agg_cols).reset_index()

    company product  quantity
0     Abatz    book        64
1     Abatz     pen         7
2     Abatz  poster        39
3     Agivu    book        11
4     Agivu   shirt        20
..      ...     ...       ...
726   Zooxo    book        30
727   Zooxo   shirt        85
728  Zoozzy     pen        31
729  Zoozzy  poster        31
730  Zoozzy   shirt        23

[731 rows x 3 columns]

And finally, here's how to set up 'named columns'. In this case, we want to know for each company, *how many* ('count') invoices there are, and out of those invoices, what was the *maximum purchase* ('max').

In [14]:
df.groupby(['company']).agg(invoice_total=('invoice','count'),max_purchase=('extended amount','max'))

           invoice_total  max_purchase
company
Abatz                  5          1410
Agivu                  2           700
Aibox                  2           828
Ailane                 3           400
Aimbo                  3           570
...                  ...           ...
Zoonoodle              3           644
Zooveo                 4           609
Zoovu                  2           165
Zooxo                  3           968
Zoozzy                 4           620

[351 rows x 2 columns]

## Pivot Tables/Crosstab
Pivot tables are kind of like groupby

In [15]:
df

,invoice,company,purchase_date,product,quantity,price,extended amount
0,ZN-870-29,Realcube,2019-03-05,shirt,19,17,323
1,JQ-501-63,Zooxo,2019-07-09,book,30,14,420
2,FI-165-58,Dabtype,2019-08-12,poster,7,23,161
3,XP-005-55,Skipfire,2019-11-18,pen,7,29,203
4,NB-917-18,Bluezoom,2019-04-18,poster,36,19,684
...,...,...,...,...,...,...,...
995,ZM-628-88,Viva,2019-09-11,pen,-5,34,-170
996,DQ-810-46,Viva,2019-09-05,pen,17,32,544
997,RA-147-40,Dabfeed,2019-03-24,poster,17,34,578
998,VT-754-54,Photobean,2019-12-30,shirt,15,18,270
999,LS-463-74,Mybuzz,2019-11-12,shirt,24,34,816

In [19]:
pd.pivot_table(df, index=['company'],
               columns=['product'],
               values=['extended amount'],
               aggfunc='sum', margins=True,fill_value=0)

        extended amount
product            book     pen  poster   shirt     All
company
Abatz              2063     140    1248       0    3451
Agivu               385       0       0     700    1085
Aibox                30     828       0       0     858
Ailane              400    -105       0       0     295
Aimbo                 0     438       0    -165     273
...                 ...     ...     ...     ...     ...
Zooveo                0     113     609     377    1099
Zoovu               165       0       0     -56     109
Zooxo               420       0       0    1378    1798
Zoozzy                0     527     620     437    1584
All              118356  115017  139008  137889  510270

[352 rows x 5 columns]

Can also have multiple aggfuncs:

In [31]:
pd.pivot_table(df, index=['company'],
               columns=['product'],
               values=['extended amount'],
               aggfunc=['sum','mean','max'], fill_value=0)

                      sum                              mean                 \
          extended amount                   extended amount
product              book  pen poster shirt            book    pen  poster
company
Abatz                2063  140   1248     0      687.666667  140.0  1248.0
Agivu                 385    0      0   700      385.000000    0.0     0.0
Aibox                  30  828      0     0       30.000000  828.0     0.0
Ailane                400 -105      0     0      400.000000 -105.0     0.0
Aimbo                   0  438      0  -165        0.000000  219.0     0.0
...                   ...  ...    ...   ...             ...    ...     ...
Zoonoodle             527  644      0   308      527.000000  644.0     0.0
Zooveo                  0  113    609   377        0.000000   56.5   609.0
Zoovu                 165    0      0   -56      165.000000    0.0     0.0
Zooxo                 420    0      0  1378      420.000000    0.0     0.0
Zoozzy                  0  527    620   437        0.000000  527.0   310.0

                             max
                 extended amount
product    shirt            book  pen poster shirt
company
Abatz        0.0            1410  140   1248     0
Agivu      700.0             385    0      0   700
Aibox        0.0              30  828      0     0
Ailane       0.0             400 -105      0     0
Aimbo     -165.0               0  570      0  -165
...          ...             ...  ...    ...   ...
Zoonoodle  308.0             527  644      0   308
Zooveo     377.0               0  143    609   377
Zoovu      -56.0             165    0      0   -56
Zooxo      689.0             420    0      0   968
Zoozzy     437.0               0  527    620   437

[351 rows x 12 columns]

Note that index=['company'],
               columns=['product'] and index=['company','product'] does the same thing, just puts everything on the y-axis

In [29]:
pd.pivot_table(df, index=['company','product'],
               values=['extended amount'],
               aggfunc=['sum'], fill_value=0)

                            sum
                extended amount
company product
Abatz   book               2063
        pen                 140
        poster             1248
Agivu   book                385
        shirt               700
...                         ...
Zooxo   book                420
        shirt              1378
Zoozzy  pen                 527
        poster              620
        shirt               437

[731 rows x 1 columns]

Crosstabs are kind of like Pivot Tables

In [25]:
pd.crosstab(df['company'],df['product'],
           values= df['extended amount'],aggfunc='sum', normalize='columns')

product        book       pen    poster     shirt
company
Abatz      0.017430  0.001217  0.008978  0.000000
Agivu      0.003253  0.000000  0.000000  0.005077
Aibox      0.000253  0.007199  0.000000  0.000000
Ailane     0.003380 -0.000913  0.000000  0.000000
Aimbo      0.000000  0.003808  0.000000 -0.001197
...             ...       ...       ...       ...
Zoonoodle  0.004453  0.005599  0.000000  0.002234
Zooveo     0.000000  0.000982  0.004381  0.002734
Zoovu      0.001394  0.000000  0.000000 -0.000406
Zooxo      0.003549  0.000000  0.000000  0.009994
Zoozzy     0.000000  0.004582  0.004460  0.003169

[351 rows x 4 columns]